[
    {
        "date_range": "Apr 21 - May 20",
        "current_date": "March 1, 2023",
        "description": "Are those relationship rumors about an acquaintance you'd like to know better still circulating? Here's a thought: Instead of joining the pack that's milling around the watercooler, why not ask this acquaintance to lunch? Trust is a nice place to start.",
        "compatibility": "Sagittarius",
        "mood": "Sincere",
        "color": "Rose Pink",
        "lucky_number": "51",
        "lucky_time": "7am",
        "sign": "taurus"
    },
    {
        "date_range": "Mar 21 - Apr 20",
        "current_date": "March 1, 2023",
        "description": "Dreams do come true. The catch is that they don't stand a chance unless you're willing to take that first step. You're ready, willing and able to pursue one now. Go get 'em!",
        "compatibility": "Aquarius",
        "mood": "Successful",
        "color": "Red",
        "lucky_number": "11",
        "lucky_time": "4am",
        "sign": "aries"
    },
    {
        "date_range": "May 21 - Jun 21",
        "current_date": "March 1, 2023",
        "description": "The universe has cooked up a recipe that's exactly what you need to fall in love. If you're single, get dressed and resume the hunt. If you're not, get dressed anyway, and take your sweetheart out for a romantic dinner.",
        "compatibility": "Sagittarius",
        "mood": "Sweet",
        "color": "Orchid",
        "lucky_number": "15",
        "lucky_time": "7am",
        "sign": "gemini"
    },
    {
        "date_range": "Jan 20 - Feb 18",
        "current_date": "March 1, 2023",
        "description": "You may need someone to help you figure out what's important and what's not. Fortunately, you know exactly who to call -- and after everything you've done for them, they'll be absolutely honored to return the favor.",
        "compatibility": "Sagittarius",
        "mood": "Lucky",
        "color": "Blue",
        "lucky_number": "61",
        "lucky_time": "4pm",
        "sign": "aquarius"
    },
    {
        "date_range": "Jul 23 - Aug 22",
        "current_date": "March 1, 2023",
        "description": "When you're indulging the detective side of your personality, you're an expert at using reflections to keep tabs on what's going on behind you. There's a mystery on your mind right now -- and mirrors won't be all you use to solve it.",
        "compatibility": "Capricorn",
        "mood": "Curious",
        "color": "Rose Pink",
        "lucky_number": "88",
        "lucky_time": "9pm",
        "sign": "leo"
    },
    {
        "date_range": "Aug 23 - Sep 22",
        "current_date": "March 1, 2023",
        "description": "Take just a little bit of time off from ignoring the phone and talk to your sweetheart, who'll be more than happy to hibernate with you. All you have to do is break down and issue the invitation.",
        "compatibility": "Leo",
        "mood": "Thoughtful",
        "color": "Copper",
        "lucky_number": "7",
        "lucky_time": "10pm",
        "sign": "virgo"
    },
    {
        "date_range": "Dec 22 - Jan 19",
        "current_date": "March 1, 2023",
        "description": "Just when you were beginning to wonder if you'd be cooking those wonderful meals for only one this week, the universe has a gift: a companion with a taste for quality -- oh, and romance, too, as an added bonus.",
        "compatibility": "Pisces",
        "mood": "Sweet",
        "color": "Red",
        "lucky_number": "81",
        "lucky_time": "12am",
        "sign": "capricorn"
    },
    {
        "date_range": "Oct 23 - Nov 22",
        "current_date": "March 1, 2023",
        "description": "It's not tough to be you right now, is it? Things are good, especially when it comes to relating with loved ones -- and if anyone is an expert at sweet-talking, it's you. You'll have occasion to use that talent tonight. Yep. Again.",
        "compatibility": "Aquarius",
        "mood": "Sweet",
        "color": "Orchid",
        "lucky_number": "16",
        "lucky_time": "3am",
        "sign": "scorpio"
    },
    {
        "date_range": "Sep 23 - Oct 22",
        "current_date": "March 1, 2023",
        "description": "Occasionally, even the fieriest among us feel the need to soften our approach, usually because of a certain someone who's touched just the right spot in our heart. It's your turn. Let it happen. Don't worry about losing your edge.",
        "compatibility": "Aries",
        "mood": "Brave",
        "color": "Rose Pink",
        "lucky_number": "22",
        "lucky_time": "5pm",
        "sign": "libra"
    },
    {
        "date_range": "Nov 23 - Dec 21",
        "current_date": "March 1, 2023",
        "description": "Enough with the cerebral sports. It's time for something a bit more serious. Don't panic, though. The seriousness will only last a little while -- just until you put a certain matter to bed, once and for all.",
        "compatibility": "Pisces",
        "mood": "Relieved",
        "color": "Rose Pink",
        "lucky_number": "5",
        "lucky_time": "11pm",
        "sign": "sagittarius"
    },
    {
        "date_range": "Jun 22 - Jul 22",
        "current_date": "March 1, 2023",
        "description": "No one's a stranger to confusion, isolation or depression. You, however, know these feelings best from counseling others against giving into them, as opposed to actually dealing with them yourself. If it's your turn to ask for help, don't hesitate.",
        "compatibility": "Aries",
        "mood": "Helpless",
        "color": "Red",
        "lucky_number": "22",
        "lucky_time": "6am",
        "sign": "cancer"
    },
    {
        "date_range": "Feb 19 - Mar 20",
        "current_date": "March 1, 2023",
        "description": "You've never been given to daydreaming, and you don't hold much stock in the symbolism some give to dreams in general. A recent image from your unconscious, however, has stayed with you -- and you're beginning to wonder if there might not be a reason.",
        "compatibility": "Taurus",
        "mood": "Thoughtful",
        "color": "Peach",
        "lucky_number": "50",
        "lucky_time": "8pm",
        "sign": "pisces"
    }
]